Using TensorFlow backend.
paramiko missing, opening SSH/SCP/SFTP paths will be disabled.  `pip install paramiko` to suppress
Zero-length sub 1
Maximum sub length: 17
Zero-length rel: 1
Maximum rel length: 5
Zero-length obj: 1
Maximum obj length: 17
Zero-length subs: 0
Maximum sub length: 17
Zero-length rels: 0
Maximum rel length: 5
Zero-length obs: 0
Maximum ob length: 17
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
lstm_3_input (InputLayer)       (None, 17, 300)      0
__________________________________________________________________________________________________
lstm_1_input (InputLayer)       (None, 17, 300)      0
__________________________________________________________________________________________________
lstm_2_input (InputLayer)       (None, 5, 300)       0
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, 150)          270600      lstm_3_input[0][0]
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 150)          270600      lstm_1_input[0][0]
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 150)          270600      lstm_2_input[0][0]
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 150)          0           lstm_3[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 150)          0           lstm_1[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 150)          0           lstm_2[0][0]
__________________________________________________________________________________________________
out3 (Dense)                    (None, 150)          22650       dropout_3[0][0]
__________________________________________________________________________________________________
out1 (Dense)                    (None, 150)          22650       dropout_1[0][0]
__________________________________________________________________________________________________
out2 (Dense)                    (None, 150)          22650       dropout_2[0][0]
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 150)          0           out3[0][0]
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 150)          0           out1[0][0]
                                                                 out2[0][0]
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 150)          0           lambda_1[0][0]
                                                                 multiply_1[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            151         multiply_2[0][0]
==================================================================================================
Total params: 879,901
Trainable params: 879,901
Non-trainable params: 0
__________________________________________________________________________________________________
None
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
lstm_1 (LSTM)                (None, 150)               270600
_________________________________________________________________
dropout_1 (Dropout)          (None, 150)               0
_________________________________________________________________
out1 (Dense)                 (None, 150)               22650
=================================================================
Total params: 293,250
Trainable params: 293,250
Non-trainable params: 0
_________________________________________________________________
None
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
lstm_2 (LSTM)                (None, 150)               270600
_________________________________________________________________
dropout_2 (Dropout)          (None, 150)               0
_________________________________________________________________
out2 (Dense)                 (None, 150)               22650
=================================================================
Total params: 293,250
Trainable params: 293,250
Non-trainable params: 0
_________________________________________________________________
None
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
lstm_3 (LSTM)                (None, 150)               270600
_________________________________________________________________
dropout_3 (Dropout)          (None, 150)               0
_________________________________________________________________
out3 (Dense)                 (None, 150)               22650
_________________________________________________________________
lambda_1 (Lambda)            (None, 150)               0
=================================================================
Total params: 293,250
Trainable params: 293,250
Non-trainable params: 0
_________________________________________________________________
None
Train on 16198 samples, validate on 1800 samples
Epoch 1/2
2019-04-10 01:57:15.608568: I tensorflow/core/platform/cpu_feature_guard.cc:137] Your CPU supports instructions that this TensorFlow binary was not compiled to use: SSE4.1 SSE4.2 AVX AVX2 FMA
16198/16198 [==============================] - 21s 1ms/step - loss: 0.6940 - acc: 0.4949 - val_loss: 0.6929 - val_acc: 0.5106
Epoch 2/2
16198/16198 [==============================] - 18s 1ms/step - loss: 0.6935 - acc: 0.4998 - val_loss: 0.6932 - val_acc: 0.4894
2000/2000 [==============================] - 1s 600us/step
[0.69314514255523685, 0.501]
17998/17998 [==============================] - 9s 506us/step
[0.69314959530354026, 0.499888876541838]
